In [1]:
%pip install numpy
%pip install pandas

Requirement already satisfied: numpy in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (1.26.4)

[notice] A new release of pip is available: 23.2.1 -> 25.0
[notice] To update, run: python3 -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/macpc/Library/Python/3.12/lib/python/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /Users/macpc/Library/Python/3.12/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.2.1 -> 25.0
[notice] To update, run: python3 -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
# Create table employee(........)
import numpy as np 
import pandas as pd 
employee = pd.DataFrame({
    "emp_id":[],
    "emp_name":[],
    "job_name":[],
    "manger_id":[],
    "hire_date":[],
    "salary":[],
    "commision":[]
})

In [3]:
# select * from employee
emp_id = [68319, 66928, 67832, 65646, 67858, 69062, 63679, 64989, 65271, 66564, 68454, 68736, 69000, 69324]
emp_name = ["KAYLING", "BLAZE", "CLARE", "JONAS", "SCARLET", "FRANK", "SANDRINE", "ADELYN", "WADE", "MADDEN", "TUCKER", "ADNRES", "JULIUS", "MARKER"]
job_name = ["PRESIDENT", "MANAGER", "MANAGER", "MANAGER", "ANALYST", "ANALYST", "CLERK", "SALESMAN", "SALESMAN", "SALESMAN", "SALESMAN", "CLERK", "CLERK", "CLERK"]
manager_id = [None, 68319, 68319, 68319, 65646, 65646, 69062, 66928, 66928, 66928, 66928, 67858, 66928, 67832]
hire_date = ["1991-11-18", "1991-05-01", "1991-06-09", "1991-04-02", "1997-04-19", "1991-12-03", "1990-12-18", "1991-02-20", "1991-02-22", "1991-09-28", "1991-09-08", "1997-05-23", "1991-12-03", "1992-01-23"]
salary = [6000.00, 2750.00, 2550.00, 2957.00, 3100.00, 3100.00, 900.00, 1700.00, 1350.00, 1350.00, 1600.00, 1200.00, 1050.00, 1400.00]
commission = [None, None, None, None, None, None, None, 400.00, 600.00, 1500.00, 0.00, None, None, None]
dep_id = [1001, 3001, 1001, 2001, 2001, 2001, 2001, 3001, 3001, 3001, 3001, 2001, 3001, 1001]

# Print example

In [4]:
employee["emp_id"] = emp_id
employee["emp_name"]= emp_name
employee["job_name"]= job_name
employee["manger_id"] = manager_id
employee["hire_date"] = hire_date
employee["salary"] = salary
employee["commision"] = commission

In [5]:
employee

    emp_id  emp_name   job_name  manger_id   hire_date  salary  commision
0    68319   KAYLING  PRESIDENT        NaN  1991-11-18  6000.0        NaN
1    66928     BLAZE    MANAGER    68319.0  1991-05-01  2750.0        NaN
2    67832     CLARE    MANAGER    68319.0  1991-06-09  2550.0        NaN
3    65646     JONAS    MANAGER    68319.0  1991-04-02  2957.0        NaN
4    67858   SCARLET    ANALYST    65646.0  1997-04-19  3100.0        NaN
5    69062     FRANK    ANALYST    65646.0  1991-12-03  3100.0        NaN
6    63679  SANDRINE      CLERK    69062.0  1990-12-18   900.0        NaN
7    64989    ADELYN   SALESMAN    66928.0  1991-02-20  1700.0      400.0
8    65271      WADE   SALESMAN    66928.0  1991-02-22  1350.0      600.0
9    66564    MADDEN   SALESMAN    66928.0  1991-09-28  1350.0     1500.0
10   68454    TUCKER   SALESMAN    66928.0  1991-09-08  1600.0        0.0
11   68736    ADNRES      CLERK    67858.0  1997-05-23  1200.0        NaN
12   69000    JULIUS      CLERK    66928.0  1991-12-03  1050.0        NaN
13   69324    MARKER      CLERK    67832.0  1992-01-23  1400.0        NaN

In [6]:

employee.to_excel("Emplyee.xlsx",index=False)

In [7]:
emp =pd.read_excel("Emplyee.xlsx")

In [8]:
emp

    emp_id  emp_name   job_name  manger_id   hire_date  salary  commision
0    68319   KAYLING  PRESIDENT        NaN  1991-11-18    6000        NaN
1    66928     BLAZE    MANAGER    68319.0  1991-05-01    2750        NaN
2    67832     CLARE    MANAGER    68319.0  1991-06-09    2550        NaN
3    65646     JONAS    MANAGER    68319.0  1991-04-02    2957        NaN
4    67858   SCARLET    ANALYST    65646.0  1997-04-19    3100        NaN
5    69062     FRANK    ANALYST    65646.0  1991-12-03    3100        NaN
6    63679  SANDRINE      CLERK    69062.0  1990-12-18     900        NaN
7    64989    ADELYN   SALESMAN    66928.0  1991-02-20    1700      400.0
8    65271      WADE   SALESMAN    66928.0  1991-02-22    1350      600.0
9    66564    MADDEN   SALESMAN    66928.0  1991-09-28    1350     1500.0
10   68454    TUCKER   SALESMAN    66928.0  1991-09-08    1600        0.0
11   68736    ADNRES      CLERK    67858.0  1997-05-23    1200        NaN
12   69000    JULIUS      CLERK    66928.0  1991-12-03    1050        NaN
13   69324    MARKER      CLERK    67832.0  1992-01-23    1400        NaN

In [9]:
# select * from emp
emp

    emp_id  emp_name   job_name  manger_id   hire_date  salary  commision
0    68319   KAYLING  PRESIDENT        NaN  1991-11-18    6000        NaN
1    66928     BLAZE    MANAGER    68319.0  1991-05-01    2750        NaN
2    67832     CLARE    MANAGER    68319.0  1991-06-09    2550        NaN
3    65646     JONAS    MANAGER    68319.0  1991-04-02    2957        NaN
4    67858   SCARLET    ANALYST    65646.0  1997-04-19    3100        NaN
5    69062     FRANK    ANALYST    65646.0  1991-12-03    3100        NaN
6    63679  SANDRINE      CLERK    69062.0  1990-12-18     900        NaN
7    64989    ADELYN   SALESMAN    66928.0  1991-02-20    1700      400.0
8    65271      WADE   SALESMAN    66928.0  1991-02-22    1350      600.0
9    66564    MADDEN   SALESMAN    66928.0  1991-09-28    1350     1500.0
10   68454    TUCKER   SALESMAN    66928.0  1991-09-08    1600        0.0
11   68736    ADNRES      CLERK    67858.0  1997-05-23    1200        NaN
12   69000    JULIUS      CLERK    66928.0  1991-12-03    1050        NaN
13   69324    MARKER      CLERK    67832.0  1992-01-23    1400        NaN

In [10]:
# select emp_name  from emp
emp["emp_name"]

0      KAYLING
1        BLAZE
2        CLARE
3        JONAS
4      SCARLET
5        FRANK
6     SANDRINE
7       ADELYN
8         WADE
9       MADDEN
10      TUCKER
11      ADNRES
12      JULIUS
13      MARKER
Name: emp_name, dtype: object

In [11]:
# select emp_name, job_name  from emp
emp[["emp_name","job_name"]]

    emp_name   job_name
0    KAYLING  PRESIDENT
1      BLAZE    MANAGER
2      CLARE    MANAGER
3      JONAS    MANAGER
4    SCARLET    ANALYST
5      FRANK    ANALYST
6   SANDRINE      CLERK
7     ADELYN   SALESMAN
8       WADE   SALESMAN
9     MADDEN   SALESMAN
10    TUCKER   SALESMAN
11    ADNRES      CLERK
12    JULIUS      CLERK
13    MARKER      CLERK

In [12]:
# select max(salary) from emp
emp["salary"].max()

6000

In [13]:
# select min(salary) from emp
emp["salary"].min()

900

In [14]:
# select avg(salary) from emp
emp["salary"].mean()

2214.785714285714

In [15]:
# select median(salary) from emp
emp["salary"].median()

1650.0

In [16]:
#selec count(emp_name) from emp
len(emp["emp_name"])

14

In [17]:
#select distinct(job_name) from emp
emp["job_name"].unique()

array(['PRESIDENT', 'MANAGER', 'ANALYST', 'CLERK', 'SALESMAN'],
      dtype=object)

In [18]:
#select count(distinct(job_name)) from emp
len(emp["job_name"].unique())

5

In [19]:
# select sum(salary) from emp
emp["salary"].sum()

31007

In [20]:
# select emp_name from emp where job_name = "Analyst"
emp["emp_name"][emp["job_name"]=="ANALYST"]

4    SCARLET
5      FRANK
Name: emp_name, dtype: object

In [21]:
emp["hire_date"] = pd.to_datetime(emp["hire_date"])

In [22]:
emp["hire_date"].dt.month_name()

0      November
1           May
2          June
3         April
4         April
5      December
6      December
7      February
8      February
9     September
10    September
11          May
12     December
13      January
Name: hire_date, dtype: object

In [23]:
emp[emp["hire_date"].dt.month == 5]

    emp_id emp_name job_name  manger_id  hire_date  salary  commision
1    66928    BLAZE  MANAGER    68319.0 1991-05-01    2750        NaN
11   68736   ADNRES    CLERK    67858.0 1997-05-23    1200        NaN

In [24]:
emp[emp["hire_date"].dt.year >  1991]

    emp_id emp_name job_name  manger_id  hire_date  salary  commision
4    67858  SCARLET  ANALYST    65646.0 1997-04-19    3100        NaN
11   68736   ADNRES    CLERK    67858.0 1997-05-23    1200        NaN
13   69324   MARKER    CLERK    67832.0 1992-01-23    1400        NaN

In [25]:
emp[emp["hire_date"].dt.year==1991]

    emp_id emp_name   job_name  manger_id  hire_date  salary  commision
0    68319  KAYLING  PRESIDENT        NaN 1991-11-18    6000        NaN
1    66928    BLAZE    MANAGER    68319.0 1991-05-01    2750        NaN
2    67832    CLARE    MANAGER    68319.0 1991-06-09    2550        NaN
3    65646    JONAS    MANAGER    68319.0 1991-04-02    2957        NaN
5    69062    FRANK    ANALYST    65646.0 1991-12-03    3100        NaN
7    64989   ADELYN   SALESMAN    66928.0 1991-02-20    1700      400.0
8    65271     WADE   SALESMAN    66928.0 1991-02-22    1350      600.0
9    66564   MADDEN   SALESMAN    66928.0 1991-09-28    1350     1500.0
10   68454   TUCKER   SALESMAN    66928.0 1991-09-08    1600        0.0
12   69000   JULIUS      CLERK    66928.0 1991-12-03    1050        NaN

In [26]:
emp["month"]=emp["hire_date"].dt.month

In [27]:
emp["year"] =emp["hire_date"].dt.year

In [28]:
for i in range(len(emp.values)):
    if emp["month"][i] == 5 and emp["year"][i] == 1991:
        print(emp["emp_name"][i])

BLAZE

In [29]:
emp.groupby("job_name")["salary"].sum()

job_name
ANALYST      6200
CLERK        4550
MANAGER      8257
PRESIDENT    6000
SALESMAN     6000
Name: salary, dtype: int64

In [32]:
df=emp.groupby("job_name")["salary"].sum()

In [33]:
df

job_name
ANALYST      6200
CLERK        4550
MANAGER      8257
PRESIDENT    6000
SALESMAN     6000
Name: salary, dtype: int64

In [34]:
df.ANALYST

6200

In [35]:
df.CLERK

4550